def flatten_list(nested_list):
    return [item for sublist in nested_list for item in sublist]


# SageMath에서 변수를 정의합니다.
var('x, b, L, n, h')

L = 2
n = 2
h = 2
D = 1
c = matrix(L+1, L+1, [var("c_{}{}".format(i,j),latex_name="c_{{{}{}}}".format(i,j)) for i in [0..L] for j in [0..L]])

print("(h+1)*(D+1)^(n-1) < (L+1)^n : ", (h+1)*(D+1)^(n-1) < (L+1)^n)
print("------------------------------------------------------------------------------------------------------------------------------------------------------------------------")

# 주어진 함수를 정의합니다.
f = sum(sum(c[s,t]*3^(s*x)*2^(t*x) for s in range(L+1)) for t in range(L+1))

# 함수 f에서 가장 윗 계수 c[L,L]을 -1로 대체합니다.
f = f.subs(c[L,L] == -1)

# 함수를 x에 대해 D번까지 미분합니다.
df = [f.diff(x, i) for i in range(D+1)]

# 미분한 결과를 출력합니다.
print(latex(df))
print("-----------------------------------------------------------------------------------------------------------------------------------------------------------------------")


# log(3)을 b*log(2)로 대체합니다. (log(3)^3을 b^3**log(2)^3 로 문제없이 잘 대체합니다.)
dfb = [d.subs(log(3) == b*log(2)) for d in df]

# 결과를 출력합니다.
print(latex(dfb))
print("------------------------------------------------------------------------------------------------------------------------------------------------------------------------")


# b에 대한 항과 그렇지 않은 항을 분리합니다.
dfb_b_terms = [d.coefficients(b) for d in dfb]

# 결과를 출력합니다.
# print(latex(dfb_b_terms))
# print("------------------------------------------------------------------------------------------------------------------------------------------------------------------------")
# 각 계수를 별도의 함수로 정의합니다.
cf = [[(term[0]/log(2)^m).simplify_full().expand() for term in terms] for m,terms in enumerate(dfb_b_terms)]

print("number of equations: ", len(flatten_list(cf))*(h+1))
print("number of variables: ", (L+1)**n)
print("------------------------------------------------------------------------------------------------------------------------------------------------------------------------")
# 결과를 출력합니다.

# print(latex(cf))
# print("------------------------------------------------------------------------------------------------------------------------------------------------------------------------")
# 
# print(latex(c))
# print("------------------------------------------------------------------------------------------------------------------------------------------------------------------------")

# f_b=[]
# 각 함수를 출력합니다.
# for i, fi in enumerate(cf):
    # f_b.append((fi/log(2)^m).simplify_full().expand())#[m.expand() for m in .operands()]
    # print(f"f_b^{i}(x) = {[m.expand() for m in (fi/log(2)).simplify_full().expand().operands()]}")
    # for j in range(h+1):
        # print(f_b[i](x=j))#[g(x=j) for g in ])


# 방정식 시스템을 정의합니다.
eqs = [[[cf[i][j](x=l) == 0 for l in range(h+1)] for j in range(i+1)] for i in range(D+1)]
eqs_flat = flatten_list(flatten_list(eqs))

# 결과를 출력합니다.
# print(eqs)
# print("------------------------------------------------------------------------------------------------------------------------------------------------------------------------")
# print(latex(eqs_flat))
# print("------------------------------------------------------------------------------------------------------------------------------------------------------------------------")

def linear_equations_to_matrix(eqns,c):
    return (matrix([[eq.lhs().coefficient(v) for v in c] for eq in eqns])
    ,c)
# from sage.symbolic.relation import linear_equations_to_matrix

# A, b = linear_equations_to_matrix(eqs_flat, flatten_list(c))

# Now, 'A' is the coefficient matrix and 'b' is the constant vector

# print("Coefficient matrix, A:")
# print(latex(A))
# print("Constant vector, b:")
# print(latex(b))
# print("------------------------------------------------------------------------------------------------------------------------------------------------------------------------")

# 방정식 시스템을 풉니다.
solution = solve(eqs_flat, flatten_list(c), solution_dict=True)

# 해를 출력합니다.
print(latex(solution))
print("------------------------------------------------------------------------------------------------------------------------------------------------------------------------")

df_sol = [d.subs(solution) for d in df]
print(latex(df_sol))
print("------------------------------------------------------------------------------------------------------------------------------------------------------------------------")

g = Graphics()
for i in range(D+1):
    g += plot(df_sol[i](x=x),(x,-(h+0.01),h+0.01))
g.show()
# 각 항을 분배 법칙에 따라 재구성합니다.
# dfb_expanded = dfb.expand()

# 재구성된 식을 출력합니다.
# print(dfb_b_terms)
# print("------------------------------------------------------------------------------------------------------------------------------------------------------------------------")
# 미분한 결과를 출력합니다.
# print(dfb)
# print("------------------------------------------------------------------------------------------------------------------------------------------------------------------------")
# print(f)
# print("------------------------------------------------------------------------------------------------------------------------------------------------------------------------")
# print(latex(dfb))
# print(latex(dfb))
# print(latex(f))